---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Number
source: html/94b30a86-6682-798d-ca49-d71ba7ed50ea.htm
---
# Autodesk.Revit.DB.SpecTypeId.Number Property

Number, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId Number { get; }
```